# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16]
# [2, 3, 5, 6] => [12, 15]
import math

list1 = [2, 3, 4, 5, 6]

list2 = []
length = math.ceil(len(list1) / 2)
for i in range(length):
    list2.append(list1[i] * list1[len(list1) - 1 - i])

print(f'Произведение пар чисел списка равно {list2}')